tests/wrk/Mvp2MockTestQPS.log
Performance Test Results - Tue Dec  9 09:09:43 AM CST 2025
=======================================


### Test with Connections: 200, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.81ms  703.98us  30.30ms   91.79%
    Req/Sec    10.39k   720.76    14.02k    76.25%
  1240652 requests in 30.03s, 346.37MB read
  Non-2xx or 3xx responses: 1223252
Requests/sec:  41310.68
Transfer/sec:     11.53MB


### Test with Connections: 400, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.02ms  635.76us  22.75ms   89.13%
    Req/Sec     9.98k   383.18    11.11k    77.00%
  1192339 requests in 30.08s, 332.19MB read
  Non-2xx or 3xx responses: 1189339
Requests/sec:  39634.61
Transfer/sec:     11.04MB


### Test with Connections: 600, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 600 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.82ms    1.27ms  39.69ms   90.58%
    Req/Sec    10.10k   739.30    15.36k    70.89%
  1206569 requests in 30.10s, 336.15MB read
  Non-2xx or 3xx responses: 1203669
Requests/sec:  40086.35
Transfer/sec:     11.17MB


### Test with Connections: 800, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.26ms    1.25ms  41.17ms   87.49%
    Req/Sec     9.42k   707.22    13.81k    78.80%
  1124412 requests in 30.09s, 313.27MB read
  Non-2xx or 3xx responses: 1121612
Requests/sec:  37371.27
Transfer/sec:     10.41MB


### Test with Connections: 1000, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.36ms    1.41ms  66.68ms   76.11%
    Req/Sec     9.50k   727.93    11.95k    76.76%
  1131370 requests in 30.02s, 315.21MB read
  Non-2xx or 3xx responses: 1128370
Requests/sec:  37684.00
Transfer/sec:     10.50MB


### Test with Connections: 1500, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 1500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.54ms    4.64ms  72.08ms   56.84%
    Req/Sec     9.04k     1.40k   11.36k    49.16%
  1077596 requests in 30.05s, 300.23MB read
  Non-2xx or 3xx responses: 1074696
Requests/sec:  35865.87
Transfer/sec:      9.99MB


### Test with Connections: 2000, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    62.20ms    2.82ms  99.24ms   87.46%
    Req/Sec     8.06k     1.20k   10.10k    60.45%
  959644 requests in 30.04s, 267.38MB read
  Non-2xx or 3xx responses: 956844
Requests/sec:  31943.81
Transfer/sec:      8.90MB
=======================================