tests/wrk/base_performance_results.log
Performance Test Results - Thu Oct 30 04:44:06 PM CST 2025
=======================================


### Test with Connections: 200, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    95.22ms  147.98ms   1.18s    89.75%
    Req/Sec     1.02k   255.06     1.79k    68.67%
  121872 requests in 30.08s, 7.90MB read
Requests/sec:   4051.34
Transfer/sec:    269.03KB


### Test with Connections: 400, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   122.08ms  130.77ms   1.05s    86.96%
    Req/Sec     1.10k   289.20     3.60k    70.84%
  130751 requests in 30.05s, 8.48MB read
Requests/sec:   4350.47
Transfer/sec:    288.90KB


### Test with Connections: 600, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 600 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   195.23ms  236.92ms   1.97s    88.51%
    Req/Sec     1.06k   343.96     2.26k    70.16%
  116509 requests in 30.07s, 7.56MB read
  Socket errors: connect 0, read 0, write 0, timeout 623
Requests/sec:   3874.22
Transfer/sec:    257.27KB


### Test with Connections: 800, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   211.55ms  182.27ms   1.13s    85.56%
    Req/Sec     1.06k   421.40     3.31k    66.15%
  116741 requests in 30.10s, 7.57MB read
  Socket errors: connect 0, read 0, write 0, timeout 800
Requests/sec:   3878.33
Transfer/sec:    257.55KB


### Test with Connections: 1000, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   279.04ms  249.93ms   1.82s    86.28%
    Req/Sec     1.06k   446.19     2.50k    69.10%
  125862 requests in 30.04s, 8.16MB read
Requests/sec:   4189.70
Transfer/sec:    278.22KB


### Test with Connections: 1500, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 1500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   379.79ms  289.48ms   1.80s    78.75%
    Req/Sec     1.10k   544.86     3.56k    70.11%
  128486 requests in 30.10s, 8.33MB read
  Socket errors: connect 0, read 0, write 0, timeout 29
Requests/sec:   4269.02
Transfer/sec:    283.49KB


### Test with Connections: 2000, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   562.67ms  366.92ms   2.00s    72.07%
    Req/Sec     0.97k   702.78     3.87k    69.98%
  91151 requests in 30.05s, 5.91MB read
  Socket errors: connect 0, read 0, write 0, timeout 4340
Requests/sec:   3033.25
Transfer/sec:    201.43KB
=======================================