tests/wrk/base_performance_results_without_log.log
Performance Test Results - Thu Oct 30 04:56:14 PM CST 2025
=======================================


### Test with Connections: 200, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.10ms    1.27ms  33.34ms   88.04%
    Req/Sec    24.85k     1.82k   33.86k    75.00%
  2966708 requests in 30.04s, 192.39MB read
Requests/sec:  98772.36
Transfer/sec:      6.41MB


### Test with Connections: 400, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.12ms    1.77ms  58.71ms   84.17%
    Req/Sec    24.69k     1.68k   46.03k    78.00%
  2947213 requests in 30.05s, 191.13MB read
Requests/sec:  98079.39
Transfer/sec:      6.36MB


### Test with Connections: 600, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 600 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.28ms    1.95ms  38.89ms   71.49%
    Req/Sec    24.07k     1.25k   35.21k    80.50%
  2874699 requests in 30.09s, 186.42MB read
Requests/sec:  95547.36
Transfer/sec:      6.20MB


### Test with Connections: 800, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.26ms    2.85ms  57.48ms   75.41%
    Req/Sec    24.45k     1.69k   56.53k    87.74%
  2918040 requests in 30.10s, 189.23MB read
Requests/sec:  96956.54
Transfer/sec:      6.29MB


### Test with Connections: 1000, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.36ms    2.55ms  62.57ms   83.15%
    Req/Sec    24.34k     1.30k   35.34k    89.32%
  2905004 requests in 30.08s, 188.39MB read
Requests/sec:  96588.12
Transfer/sec:      6.26MB


### Test with Connections: 1500, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 1500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.63ms    3.91ms  70.50ms   71.44%
    Req/Sec    24.11k     1.09k   32.74k    79.85%
  2869699 requests in 30.02s, 186.10MB read
Requests/sec:  95589.48
Transfer/sec:      6.20MB


### Test with Connections: 2000, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/log
  4 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.11ms    6.78ms  73.49ms   78.97%
    Req/Sec    23.94k     1.12k   29.00k    76.92%
  2851520 requests in 30.04s, 184.92MB read
Requests/sec:  94924.38
Transfer/sec:      6.16MB
=======================================