tests/wrk/mvp2_backpressure_test_results.log
Performance Test Results (MVP2 Back-pressure) - Tue Dec  9 09:24:28 AM CST 2025
Target: http://127.0.0.1:8080/logs
=======================================


### Connections: 50, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27ms  418.66us  21.74ms   95.73%
    Req/Sec     9.54k   625.22    14.54k    82.17%
  Latency Distribution
     50%    1.23ms
     75%    1.30ms
     90%    1.38ms
     99%    1.99ms
  1139519 requests in 30.01s, 318.42MB read
  Non-2xx or 3xx responses: 1117819
Requests/sec:  37966.00
Transfer/sec:     10.61MB


### Connections: 200, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.82ms  436.99us  15.02ms   89.77%
    Req/Sec    10.36k   458.91    16.96k    77.83%
  Latency Distribution
     50%    4.77ms
     75%    4.95ms
     90%    5.12ms
     99%    6.44ms
  1237684 requests in 30.05s, 344.81MB read
  Non-2xx or 3xx responses: 1234784
Requests/sec:  41188.71
Transfer/sec:     11.48MB


### Connections: 1000, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.44ms    1.46ms  58.02ms   93.22%
    Req/Sec    10.23k   509.93    12.59k    82.61%
  Latency Distribution
     50%   24.35ms
     75%   24.57ms
     90%   24.91ms
     99%   29.27ms
  1219698 requests in 30.07s, 339.80MB read
  Non-2xx or 3xx responses: 1216898
Requests/sec:  40558.35
Transfer/sec:     11.30MB


### Connections: 2000, Threads: 4, Duration: 30s ###
Running 30s test @ http://127.0.0.1:8080/logs
  4 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    62.68ms    3.47ms 101.01ms   90.75%
    Req/Sec     8.00k     1.73k   28.14k    62.07%
  Latency Distribution
     50%   62.88ms
     75%   63.76ms
     90%   64.86ms
     99%   68.03ms
  953547 requests in 30.10s, 265.69MB read
  Non-2xx or 3xx responses: 950547
Requests/sec:  31679.13
Transfer/sec:      8.83MB
=======================================