tests/wrk/mvp2_strict_performance.log
Strict Performance Test - Tue Dec  9 09:34:02 AM CST 2025
Target: http://127.0.0.1:8080/logs


### Fresh Run: Connections: 50 ###
Running 15s test @ http://127.0.0.1:8080/logs
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.25ms  314.22us  13.50ms   92.00%
    Req/Sec     9.59k     1.34k   36.70k    92.85%
  Latency Distribution
     50%    1.22ms
     75%    1.28ms
     90%    1.38ms
     99%    1.94ms
  573547 requests in 15.10s, 160.75MB read
  Non-2xx or 3xx responses: 553071
Requests/sec:  37984.40
Transfer/sec:     10.65MB


### Fresh Run: Connections: 200 ###
Running 15s test @ http://127.0.0.1:8080/logs
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.83ms  545.46us  17.10ms   89.61%
    Req/Sec    10.35k   653.14    11.99k    84.00%
  Latency Distribution
     50%    4.74ms
     75%    4.90ms
     90%    5.12ms
     99%    6.57ms
  618649 requests in 15.01s, 173.31MB read
  Non-2xx or 3xx responses: 598229
Requests/sec:  41202.24
Transfer/sec:     11.54MB


### Fresh Run: Connections: 1000 ###
Running 15s test @ http://127.0.0.1:8080/logs
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.20ms    2.26ms  55.01ms   91.71%
    Req/Sec     9.21k   841.46    10.10k    77.50%
  Latency Distribution
     50%   26.67ms
     75%   27.39ms
     90%   28.77ms
     99%   37.00ms
  550160 requests in 15.07s, 154.22MB read
  Non-2xx or 3xx responses: 529660
Requests/sec:  36503.43
Transfer/sec:     10.23MB


### Fresh Run: Connections: 2000 ###
Running 15s test @ http://127.0.0.1:8080/logs
  4 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    58.47ms    4.59ms 107.52ms   84.51%
    Req/Sec     8.42k     1.31k   12.40k    62.17%
  Latency Distribution
     50%   56.48ms
     75%   62.13ms
     90%   63.10ms
     99%   69.22ms
  503422 requests in 15.08s, 141.22MB read
  Non-2xx or 3xx responses: 482922
Requests/sec:  33379.38
Transfer/sec:      9.36MB